### Exercise 1: Comparative Analysis of Retail Data

In [1]:
import pandas as pd

In [2]:
features_data = pd.read_csv('Features data set.csv')
sales_data = pd.read_csv('sales data-set.csv')
stores_data = pd.read_csv('stores data-set.csv')

w_clothing = pd.read_csv('Womens Clothing E-Commerce Reviews.csv')

In [41]:
features_data.head()

,Store,Date,Temperature,Fuel_Price,MarkDown1,MarkDown2,MarkDown3,MarkDown4,MarkDown5,CPI,Unemployment,IsHoliday
0,1,05/02/2010,42.31,2.572,NaN,NaN,NaN,NaN,NaN,211.096358,8.106,False
1,1,12/02/2010,38.51,2.548,NaN,NaN,NaN,NaN,NaN,211.242170,8.106,True
2,1,19/02/2010,39.93,2.514,NaN,NaN,NaN,NaN,NaN,211.289143,8.106,False
3,1,26/02/2010,46.63,2.561,NaN,NaN,NaN,NaN,NaN,211.319643,8.106,False
4,1,05/03/2010,46.50,2.625,NaN,NaN,NaN,NaN,NaN,211.350143,8.106,False

In [40]:
features_data.info()
features_data.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8190 entries, 0 to 8189
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Store         8190 non-null   int64
 1   Date          8190 non-null   object
 2   Temperature   8190 non-null   float64
 3   Fuel_Price    8190 non-null   float64
 4   MarkDown1     4032 non-null   float64
 5   MarkDown2     2921 non-null   float64
 6   MarkDown3     3613 non-null   float64
 7   MarkDown4     3464 non-null   float64
 8   MarkDown5     4050 non-null   float64
 9   CPI           7605 non-null   float64
 10  Unemployment  7605 non-null   float64
 11  IsHoliday     8190 non-null   bool
dtypes: bool(1), float64(9), int64(1), object(1)
memory usage: 712.0+ KB

,Store,Temperature,Fuel_Price,MarkDown1,MarkDown2,MarkDown3,MarkDown4,MarkDown5,CPI,Unemployment
count,8190.000000,8190.000000,8190.000000,4032.000000,2921.000000,3613.000000,3464.000000,4050.000000,7605.000000,7605.000000
mean,23.000000,59.356198,3.405992,7032.371786,3384.176594,1760.100180,3292.935886,4132.216422,172.460809,7.826821
std,12.987966,18.678607,0.431337,9262.747448,8793.583016,11276.462208,6792.329861,13086.690278,39.738346,1.877259
min,1.000000,-7.290000,2.472000,-2781.450000,-265.760000,-179.260000,0.220000,-185.170000,126.064000,3.684000
25%,12.000000,45.902500,3.041000,1577.532500,68.880000,6.600000,304.687500,1440.827500,132.364839,6.634000
50%,23.000000,60.710000,3.513000,4743.580000,364.570000,36.260000,1176.425000,2727.135000,182.764003,7.806000
75%,34.000000,73.880000,3.743000,8923.310000,2153.350000,163.150000,3310.007500,4832.555000,213.932412,8.567000
max,45.000000,101.950000,4.468000,103184.980000,104519.540000,149483.310000,67474.850000,771448.100000,228.976456,14.313000

In [ ]:
features_data['InvoiceDate'] = pd.to_datetime(retail_df['InvoiceDate'])

In [9]:
sales_data.head()

   Store  Dept        Date  Weekly_Sales  IsHoliday
0      1     1  05/02/2010      24924.50      False
1      1     1  12/02/2010      46039.49       True
2      1     1  19/02/2010      41595.55      False
3      1     1  26/02/2010      19403.54      False
4      1     1  05/03/2010      21827.90      False

In [44]:
sales_data['Weekly_Sales'].sort_values().ascending

AttributeError: 'Series' object has no attribute 'ascending'

In [11]:
stores_data.head()

   Store Type    Size
0      1    A  151315
1      2    A  202307
2      3    B   37392
3      4    A  205863
4      5    B   34875

In [12]:
w_clothing.head()

,Unnamed: 0,Clothing ID,Age,Title,Review Text,Rating,Recommended IND,Positive Feedback Count,Division Name,Department Name,Class Name
0,0,767,33,NaN,Absolutely wonderful - silky and sexy and comf...,4,1,0,Initmates,Intimate,Intimates
1,1,1080,34,NaN,Love this dress! it's sooo pretty. i happene...,5,1,4,General,Dresses,Dresses
2,2,1077,60,Some major design flaws,I had such high hopes for this dress and reall...,3,0,0,General,Dresses,Dresses
3,3,1049,50,My favorite buy!,"I love, love, love this jumpsuit. it's fun, fl...",5,1,0,General Petite,Bottoms,Pants
4,4,847,47,Flattering shirt,This shirt is very flattering to all due to th...,5,1,6,General,Tops,Blouses

In [23]:
w_clothing.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23486 entries, 0 to 23485
Data columns (total 11 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Unnamed: 0               23486 non-null  int64
 1   Clothing ID              23486 non-null  int64
 2   Age                      23486 non-null  int64
 3   Title                    19676 non-null  object
 4   Review Text              22641 non-null  object
 5   Rating                   23486 non-null  int64
 6   Recommended IND          23486 non-null  int64
 7   Positive Feedback Count  23486 non-null  int64
 8   Division Name            23472 non-null  object
 9   Department Name          23472 non-null  object
 10  Class Name               23472 non-null  object
dtypes: int64(6), object(5)
memory usage: 2.0+ MB

In [26]:
w_clothing_rating = w_clothing['Rating']

In [38]:
w_clothing_rating

[0        4
 1        5
 2        3
 3        5
 4        5
         ..
 23481    5
 23482    3
 23483    3
 23484    3
 23485    5
 Name: Rating, Length: 23486, dtype: int64]

### Exercise 2: Basic Data Exploration in E-Commerce

In [51]:
import pandas as pd

new_data = pd.read_csv(r"C:\Users\User\Desktop\DI_Bootcamp\Week4_3d_week_of_learning\Day2\data.csv", encoding='cp1252')

In [52]:
new_data.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

- Load the dataset using Pandas and print the first few rows to understand its structure.
- Print basic information about the dataset, like the number of rows, columns, and column names.
- Identify which columns in the dataset represent structured data (like numerical values, dates, fixed categories).
- Suggest what type of unstructured data could complement this dataset for a more comprehensive analysis (e.g., customer reviews, product descriptions).
- Discuss how this unstructured data might be used in conjunction with the structured data.

In [53]:
new_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  object
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 33.1+ MB

#### Identify which columns in the dataset represent structured data (like numerical values, dates, fixed categories).

- **numerical values**: Quantity, UnitPrice
  
- **dates** - InvoiceDate
  
- **fixed categories**: InvoiceNo, StockCode, CustomerID, Country

- **unstructured data** - Description

#### Suggest what type of unstructured data could complement this dataset for a more comprehensive analysis (e.g., customer reviews, product descriptions).

We have unstructured data in our dataset — the product descriptions — but this is not enough for a deep analysis. I think it would be useful to include customer reviews, photos of the products, comments from social networks, and video reviews. These additional sources would help to better understand customer satisfaction, preferences, and product perception.

#### Discuss how this unstructured data might be used in conjunction with the structured data.

Unstructured data can be transformed into structured features. For example, customer reviews can be analyzed to extract ratings, sentiment scores, or common topics, and images or videos can be used to identify colors, styles, or visual patterns. By converting these unstructured data into numerical or categorical features, we can combine them with the structured data (e.g., sales, store type, quantity) for a more comprehensive analysis.

### Exercise 3: Analyzing a Public Transportation Dataset with a Focus on Data Types

- Load the dataset and display the first few rows to get a sense of the data.
- Identify and print the structured elements in the dataset, such as date-time, traffic volume, etc.
- Based on your observation of the dataset, categorize the data elements as structured or unstructured. For example, consider elements like weather descriptions, date-time, and traffic volume. Explain why you categorized them as such.

In [56]:
metro = pd.read_csv('Metro_Interstate_Traffic_Volume.csv')

In [57]:
metro.head()

,holiday,temp,rain_1h,snow_1h,clouds_all,weather_main,weather_description,date_time,traffic_volume
0,NaN,288.28,0.0,0.0,40,Clouds,scattered clouds,2012-10-02 09:00:00,5545
1,NaN,289.36,0.0,0.0,75,Clouds,broken clouds,2012-10-02 10:00:00,4516
2,NaN,289.58,0.0,0.0,90,Clouds,overcast clouds,2012-10-02 11:00:00,4767
3,NaN,290.13,0.0,0.0,90,Clouds,overcast clouds,2012-10-02 12:00:00,5026
4,NaN,291.14,0.0,0.0,75,Clouds,broken clouds,2012-10-02 13:00:00,4918

#### Identify and print the structured elements in the dataset, such as date-time, traffic volume, etc.
#### Based on your observation of the dataset, categorize the data elements as structured or unstructured. For example, consider elements like weather descriptions, date-time, and traffic volume. Explain why you categorized them as such.

- Structured data in the dataset includes: holiday, temp, rain_1h, snow_1h, clouds_all, date_time, and traffic_volume, because they either contain numerical values or follow a strict format (like date-time).

- Unstructured data includes weather_main and weather_description, as they consist of free-text weather descriptions. These fields can later be transformed into structured categories to enrich the analysis.

### Exercise 4: Basic Data Analysis in a Movie Ratings Dataset

- Load the ‘ratings.csv’ file from the dataset, which contains user ratings for movies, and display the first few rows.
- Identify and list down the structured elements in the dataset, such as user IDs, movie IDs, ratings, and timestamps.
- Explain why the data elements in the ‘ratings.csv’ file are considered structured data.

In [4]:
import pandas as pd
rating_data = pd.read_csv(r'MovieLens 20M Dataset/rating.csv')

In [5]:
rating_data.head()

   userId  movieId  rating            timestamp
0       1        2     3.5  2005-04-02 23:53:47
1       1       29     3.5  2005-04-02 23:31:16
2       1       32     3.5  2005-04-02 23:33:39
3       1       47     3.5  2005-04-02 23:32:07
4       1       50     3.5  2005-04-02 23:29:40

All of the elements are structured: Userid, MovieID, Rating and TimeStamp, because structured data contain numeric values, follow a strict formst like data. Structured data always follows a predefined schema — in this case, a table with consistent column types. Even though IDs are categorical, they still count as structured data because their format is fixed and easily machine-readable.

### Exercise 5: Creating a Synthetic Product Catalog

- Ensure that the Faker library is installed and imported into your Python environment.
- Create a dataset of 500 products. Each product should have a unique ID, name, description, and price.
- Use Pandas to create a DataFrame from the generated data.

In [14]:
!pip install faker

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: faker in c:\users\user\appdata\local\packages\pythonsoftwarefoundation.python.3.13_qbz5n2kfra8p0\localcache\local-packages\python313\site-packages (38.0.0)
Requirement already satisfied: tzdata in c:\users\user\appdata\local\packages\pythonsoftwarefoundation.python.3.13_qbz5n2kfra8p0\localcache\local-packages\python313\site-packages (from faker) (2025.2)

[notice] A new release of pip is available: 25.2 -> 25.3
[notice] To update, run: C:\Users\User\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.13_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

In [16]:
from faker import Faker
fake = Faker()

- Create a dataset of 500 products. Each product should have a unique ID, name, description, and price.
- Use Pandas to create a DataFrame from the generated data.

In [25]:
import random

In [28]:
num_records = 500

products = []
for _ in range(num_records):
    product_id = fake.unique.random_int(min = 100000, max = 999999)  
    product_name = fake.word().capitalize() + " " + random.choice ([
        "Lamp", "Chair", "Table", "Notebook", "Bottle", "Backpack", "T-shirt",
        "Shoes", "Watch", "Phone Case", "Headphones", "Mug"
    ])
    description = fake.sentence(nb_words = 12)
    price = round(random.uniform(5, 500), 2)

    products.append({'ProductID': product_id,
                'Name': product_name,
                'Description': description,
                'Price': price
                })

products_d = pd.DataFrame(products)
products_d.head(10)

,ProductID,Name,Description,Price
0,738187,Seek Backpack,Word situation charge develop enter still prot...,480.10
1,238006,Western Chair,Worry wall perform assume hope section car que...,441.64
2,358007,Natural Table,Happen road discover mention mission court bad...,101.96
3,112048,Help Phone Case,Event listen fact wide who prevent term allow ...,479.47
4,868985,Bar Notebook,Task hold father player avoid care cold.,54.40
5,301820,Cell Lamp,Father rate early nor as major week send senio...,356.27
6,107563,Sign Notebook,Particular reveal enter call ever student still.,39.57
7,794121,Road Chair,Item color process land beyond rich your resea...,290.35
8,797927,Least Headphones,Letter threat hot well staff southern five emp...,167.04
9,177411,Action Shoes,Provide memory here need floor still difficult...,34.15